In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
index = [1,2,3]
s= pd.Series(['Arwa','Aram','Maha'],index)
s

1    Arwa
2    Aram
3    Maha
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
index2 = [11,12,13]
s= pd.Series(['Arwa','Aram','Maha'],index2)
s

11    Arwa
12    Aram
13    Maha
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
s[:2]

11    Arwa
12    Aram
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [5]:
# Add elements 
s4 = pd.Series({14: 'Aram'})
ss = pd.concat([s,s4])
ss

11    Arwa
12    Aram
13    Maha
14    Aram
dtype: object

In [6]:
ss.drop_duplicates()

11    Arwa
12    Aram
13    Maha
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [7]:
data = {'ID':[12345,12346,12347],'Name':['Arwa','Aram','Maha']}
Students =pd.DataFrame(data, index, columns=["ID","Name"])
Students

      ID  Name
1  12345  Arwa
2  12346  Aram
3  12347  Maha

## Q6: Read educ_figdp_1_Data.csv file

In [8]:
df = pd.read_csv('educ_figdp_1_Data.csv')
df

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

# Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [9]:
#slice
df[5:8]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e

In [10]:
#loc 
df.loc[5:8]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e